[
  {
    "node": "01_FuelEngineLevel",
    "title": "Fuel/Engine Level",
    "camera": "Cam_01_FuelEngineLevel",
    "type": "callout",
    "description": "Before starting the vehicle, check the basic fluid levels to include fuel and engine oil. New model versions the oil is checked from the vehicle data center on the instrument panel."
  },
  {
    "node": "02_DeicingAntiIcingFluid",
    "title": "Deicing/Anti-icing Fluid Level Verification",
    "camera": "Cam_02_DeicingFluid",
    "type": "callout",
    "description": "Verify deicing and anti-icing fluid levels before leaving truck staging area. Fluid levels can be monitored throughout deicing operations using monitors inside of the deicing truck cab and basket."
  },
  {
    "node": "03_GlycolFillPorts",
    "title": "Glycol Fill Ports",
    "camera": "Cam_03_GlycolFillPorts",
    "type": "callout",
    "description": "To avoid mixing deicing and anti-icing fluids in the truck tanks all United deicing equipment are equipped with different size and style valve fittings. The fittings are incompatible with each other. Whenever top loading fluids, always verify the correct tank is loaded with the correct fluid."
  },
  {
    "node": "04_WiperFluids",
    "title": "Wiper Fluids",
    "camera": "Cam_04_WiperFluids",
    "type": "callout",
    "description": "De/anti-icing fluids can adhere to windows, windshield and mirrors limiting visibility, so making sure all window wiper fluids are full before using the deicing vehicle is a critical part of the user check. Remember, if you cannot see due to any visual obstruction, steam, or adhering de/anti-icing fluids, stop the vehicle until conditions improve."
  },
  {
    "node": "05_BoomControls",
    "title": "Boom Controls",
    "camera": "Cam_05_BoomControls",
    "type": "callout",
    "description": "The basket can be controlled from the outside of the vehicle and from inside the deicing cab. The Vestergaard Beta has three separate booms, including a telescoping nozzle, that reach a total height of 63 feet (models may vary). The instruction on how to activate these booms is part of the deicing operator's training."
  },
  {
    "node": "06_Communication",
    "title": "Communication",
    "camera": "Cam_06_Communication",
    "type": "callout",
    "description": "While operating the basket, you must establish and maintain positive communication with the vehicle driver. If using single man operations, a communication link must be established and maintained with personnel outside of the vehicle."
  },
  {
    "node": "07_GroundGuns",
    "title": "Ground Guns",
    "camera": "Cam_07_GroundGuns",
    "type": "callout",
    "description": "The ground guns on the Elephant Beta are manually operated spray nozzles mounted on heated, flexible hoses stored in a side or rear cabinet. Designed for precision work, they’re ideal for treating landing gear, engine inlets, and hard-to-reach areas where boom access is limited. The hoses typically range from 10 to 15 meters and maintain fluid temperature for effective application in cold conditions. Operators can adjust spray pattern and, on newer models, select between Type I and Type IV fluids before spraying."
  },
  {
    "node": "08_EmergencyStops",
    "title": "Emergency Stops (E-Stop)",
    "camera": "Cam_08_EmergencyStops",
    "type": "callout",
    "description": "In an emergency requiring immediate termination of all boom movement, fluid pumping and operational drive: The location of all emergency stop switches for the local station equipment will be trained in the equipment operator training."
  },
  {
    "node": "09_DeicingAccessPort",
    "title": "Deicing (Type I) Access Port",
    "camera": "Cam_09_DeicingAccessPort",
    "type": "callout",
    "description": "This access port is used to extract or test the deicing fluid (Type I) mixture. The port location varies by model and is typically found on the body of the vehicle. Operators must ensure proper PPE is worn, as the fluid may be hot and pressurized."
  },
  {
    "node": "10_AntiIcingAccessPort",
    "title": "Anti-Icing (Type IV) Access Port",
    "camera": "Cam_10_AntiIcingAccessPort",
    "type": "callout",
    "description": "Used to sample or verify the anti-icing (Type IV) fluid, this access point ensures the fluid is within the correct specification before being applied. Always confirm the port location based on the specific Beta model in use."
  },
  {
    "node": "11_DeicingFluidPlacard",
    "title": "Deicing Fluid Placard",
    "camera": "Cam_11_DeicingFluidPlacard",
    "type": "callout",
    "description": "Each deicing fluid tank is clearly labeled with a placard identifying it as Type I fluid. This helps prevent cross-contamination and ensures the correct fluid is applied during operations. Always verify placards match the fluid being filled or used."
  },
  {
    "node": "12_AntiIceFluidPlacard",
    "title": "Anti-Ice Fluid Placard",
    "camera": "Cam_12_AntiIceFluidPlacard",
    "type": "callout",
    "description": "Anti-icing fluid tanks are marked with a distinct Type IV placard. Proper identification is critical during fluid loading and application. Operators must confirm all placards are present, legible, and match the corresponding tank contents."
  },
  {
    "node": "13_TelescopingNozzle",
    "title": "Telescoping Nozzle",
    "camera": "Cam_13_TelescopingNozzle",
    "type": "callout",
    "description": "The Vestergaard Beta features a telescoping spray nozzle integrated into the boom system. This design allows the operator to maintain a close and controlled distance from the aircraft surface, enhancing spray precision and reducing fluid waste. The nozzle can extend as part of the boom’s reach up to 63 feet."
  },
  {
    "node": "14_BoomSystem",
    "title": "Boom System",
    "camera": "Cam_14_BoomSystem",
    "type": "callout",
    "description": "The Vestergaard Beta is equipped with a three-part boom system, including a telescoping center section. It provides a maximum nozzle height of up to 63 feet (model dependent), allowing operators to access high and hard-to-reach areas of the aircraft safely and efficiently."
  },
  {
    "node": "Cam_15_BasketView",
    "title": "Basket Interior",
    "camera": "Cam_15_BasketView",
    "type": "camera"
  },
  {
    "node": "Cam_16_CabinView",
    "title": "Cabin Interior",
    "camera": "Cam_16_CabinView",
    "type": "camera"
  },
  {
    "node": "Cam_17_ExteriorView",
    "title": "Exterior",
    "camera": "Cam_17_ExteriorView",
    "type": "camera"
  },
  {
    "node": "18_BoomContrlF1",
    "title": "F1",
    "camera": "Cam_18_BoomContrlF1",
    "type": "callout",
    "description": "Often activates spray preset 1 (e.g., Type I fluid at a defined temperature and pressure)."
  },
  {
    "node": "19_BoomContrlF2",
    "title": "F2",
    "camera": "Cam_19_BoomContrlF2",
    "type": "callout",
    "description": "Usually toggles spray preset 2 (e.g., switching to Type IV fluid or changing spray pattern)."
  },
  {
    "node": "20_BoomContrlF3",
    "title": "F3",
    "camera": "Cam_20_BoomContrlF3",
    "type": "callout",
    "description": "Can be user-programmable, but is sometimes mapped to things like boom auto-stow, wiper spray, or intercom toggle."
   },
  {
    "node": "21_HMIdisplay",
    "title": "HMI Display",
    "camera": "Cam_21_HMIdisplay",
    "type": "callout",
     "description": "HMI display (a Human‑Machine Interface) which is tied to the basket’s control system. Here’s what it does:\n\n•  Operational Feedback: Shows system status—hydraulic pressure, fluid mix, temperature, and alerts.\n\n• Mode Transitions: Lets you shift between standard modes (spray, stow, service) and shows prompts—like when a keypad override is needed.\n\n• Diagnostics & Alarms: Displays error codes or warnings, especially during or after an E‑stop event, and triggers the keypad reset to continue."
 },
 {
   "node": "22_Maintenance&OverrideAccess",
   "title": "Maintenance & Override Access",
   "camera": "Cam_22_Maintenance&OverrideAccess",
   "type": "callout",
   "description": "Authorized users (maintenance, techs, supervisors) can dial in a service code that temporarily unlocks restricted functions—like basket lowering, limited boom movement, or accessing diagnostics—while staying within safety limits."
 },
 {
   "node": "23_SafetyModeActivation(Optional)",
   "title": "Safety Mode Activation (Optional)",
   "camera": "Cam_23_SafetyModeActivation(Optional)",
   "type": "callout",
   "description": "Some setups use the keypad to engage a \"restricted speed mode\" or to disable certain presets (like F‑buttons) until confirmed safe."
 },
 {
   "node": "24_LockoutControl",
   "title": "Lockout Control",
   "camera": "Cam_24_LockoutControl",
   "type": "callout",
   "description": "When the basket is unoccupied, the keypad can lock control inputs, preventing accidental activation. Only someone with the code can unlock and operate the boom again."
 },
 {
   "node": "25_HeadsetVolume",
   "title": "Headset Voulme (Left & Right)",
   "camera": "Cam_25_HeadsetVolume",
   "type": "callout",
   "description": "Adjusts volume individually for the left and right operator headsets — useful in dual-operator or training setups."
 },
 {
   "node": "26_SystemVolume",
   "title": "System Volume",
   "camera": "Cam_26_SystemVolume",
   "type": "callout",
   "description": "Controls the overall system speaker volume (e.g., warnings, internal radio chatter)."
 },
 {
   "node": "27_ToggleSwitch",
   "title": "Toggle Switch (On/Off)",
   "camera": "Cam_27_ToggleSwitch",
   "type": "callout",
   "description": "Powers the intercom system on or off — usually tied to ignition or cabin accessory power."
 },
 {
   "node": "28_RoundKnob",
   "title": "Round Knob",
   "camera": "Cam_28_RoundKnob",
   "type": "callout",
   "description": "Sometimes a master gain or mic sensitivity adjustment (depending on model — could also be push-to-test for the audio line)."
 },
 {
  "node": "29_EmergencyStop",
  "title": "Emergency Stop (E‑Stop)",
  "camera": "Cam_29_EmergencyStop",
  "type": "callout",
  "description": "The top red button is the emergency stop, designed for instant shutdown of hydraulic power and pump systems from the ground. It’s a large, mushroom-style pushbutton that immediately halts operations in critical situations."
},
{
  "node": "30_SystemRestartReset",
  "title": "System Restart/Reset",
  "camera": "Cam_30_SystemRestartReset",
  "type": "callout",
  "description": "The button underneath is the system reset, often referred to as a restart or acknowledge button. After the top E‑stop is activated, this button must be pressed to reset the emergency circuit—sometimes followed by compliance steps before normal operations resume."
}
]